### Problem mz02-1: mz02-1

Описать класс ```С``` таким образом, чтобы были верными все конструкции следующего фрагмента программы:

```c++
const char C::c = '+';
int main()
{
    C ob;
    C::f();
    return 0;
}
```

### Problem mz02-2: mz02-2

Определите класс ```C``` так, чтобы компилировался приведенный ниже фрагмент программы.

```c++
C func1(const C &v1, int v2)
{
    return C(v2 + v1, ~v1);
}

void func2(const C *p1, double p2)
{
    C v1 = p2;
    C v2[2][2];
    C v3 = func1(func1(func1(&p1[3], p2), ~p1[2]), ++v1 * v2[1]);
}    
```

### Problem mz02-3: mz02-3

Напишите программу, которая выполняет RLE-кодирование стандартного потока ввода.

При RLE (run length encoding) кодировании последовательность одинаковых идущих подряд символов заменяется на специальный маркер с длиной последовательности.

Последовательности одинаковых символов длиной не более 4 остаются без изменений (кроме символа '#'). Последовательности одинаковых символов длиной более 4 заменяются на последовательность символов '#', CHAR, N, '#', где CHAR — это символ, N — число повторений, записываемое в текстовом виде в шестнадцатеричной системе счисления с цифрами 0-9 и a-f.

Последовательность символов '#' любой длины кодируется всегда как описано выше.

Использовать ввод-вывод языка Си++.

**Examples**

_Input_

```
aaaaa#a
```

_Output_

```
#a5###1#a
```

### Problem mz02-4: mz02-4

Напишите класс ```BinaryNumber```, который увеличивает на 1 число, записанное в двоичном виде. Допускаются только положительные числа. В числе отсутствуют ведущие нули.

В классе должны быть определены следующие конструкторы и методы:

```c++
// здесь могут быть нужные Вам директивы #include

class BinaryNumber
{
public:
    BinaryNumber(const string &s);
    operator string () const;
    const BinaryNumber &operator++();
};
```

Ошибки компиляции штрафуются!

### Problem mz02-5: mz02-5

Сделайте класс для хранения матрицы размером 3x3, так чтобы работал следующий фрагмент кода:

```c++
int main() {
   Matrix m;
   m[1, 1] = 5;

   for (const auto &row : m) {
        for (auto cell : row) {
            cout << cell << " ";
        }
        cout << "\n";
   }
}
```

**Notes**

use c++23 features
